DanBeard/RETCON/microretcon/firmware/sdkconfig.defaults
# MicroRETCON — XIAO ESP32S3 (N16R8: 16 MB flash, 8 MB octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"

# Flash 16 MB QIO
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# PSRAM: XIAO ESP32S3 is an *octal* module ( Embold/Renessa OPI )
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCTAL=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y

# Partition table (see partitions.csv: 3 MB app + 12.5 MB FAT)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console over USB CDC (XIAO S3 has the USB-Serial/JTAG peripheral wired
# to its USB-C connector; no external UART bridge on board)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# crns is no-heap/no-exceptions/no-threads C++20
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# FreeRTOS: crns host loop wants one core pinned (main task core 0)
CONFIG_FREERTOS_HZ=1000

# ESP-NOW: 1470-byte payload needs v2 (IDF >= 5.4 has ESP_NOW_MAX; this
# build targets 5.3.2 where MAX is 250 for v1 — VERIFY at M2 bring-up;
# the rWatch/piratebot finding says IDF >= 5.4.2 for 1470B)
# CONFIG_ESP_WIFI_ENABLE_ESP_NOW_FORCE_V2 not available in 5.3 —
# revisit version pin at M2 sprint start.
